arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom1284.h
/* Pin Change Interrupt Request 2 */
#define PCINT2_vect            _VECTOR(6)
#define PCINT2_vect_num        6

/* Pin Change Interrupt Request 3 */
#define PCINT3_vect            _VECTOR(7)
#define PCINT3_vect_num        7

/* Watchdog Time-out Interrupt */
#define WDT_vect            _VECTOR(8)
#define WDT_vect_num        8

/* Timer/Counter2 Compare Match A */
#define TIMER2_COMPA_vect            _VECTOR(9)
#define TIMER2_COMPA_vect_num        9

/* Timer/Counter2 Compare Match B */
#define TIMER2_COMPB_vect            _VECTOR(10)
#define TIMER2_COMPB_vect_num        10

/* Timer/Counter2 Overflow */
#define TIMER2_OVF_vect            _VECTOR(11)
#define TIMER2_OVF_vect_num        11

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(12)
#define TIMER1_CAPT_vect_num        12

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(13)
#define TIMER1_COMPA_vect_num        13

/* Timer/Counter1 Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(14)
#define TIMER1_COMPB_vect_num        14

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(15)
#define TIMER1_OVF_vect_num        15

/* Timer/Counter0 Compare Match A */
#define TIMER0_COMPA_vect            _VECTOR(16)
#define TIMER0_COMPA_vect_num        16

/* Timer/Counter0 Compare Match B */
#define TIMER0_COMPB_vect            _VECTOR(17)
#define TIMER0_COMPB_vect_num        17

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(18)
#define TIMER0_OVF_vect_num        18

/* SPI Serial Transfer Complete */
#define SPI_STC_vect            _VECTOR(19)
#define SPI_STC_vect_num        19

/* USART0, Rx Complete */
#define USART0_RX_vect            _VECTOR(20)
#define USART0_RX_vect_num        20

/* USART0 Data register Empty */
#define USART0_UDRE_vect            _VECTOR(21)
#define USART0_UDRE_vect_num        21

/* USART0, Tx Complete */
#define USART0_TX_vect            _VECTOR(22)
#define USART0_TX_vect_num        22

/* Analog Comparator */
#define ANALOG_COMP_vect            _VECTOR(23)
#define ANALOG_COMP_vect_num        23

/* ADC Conversion Complete */
#define ADC_vect            _VECTOR(24)
#define ADC_vect_num        24

/* EEPROM Ready */
#define EE_READY_vect            _VECTOR(25)
#define EE_READY_vect_num        25

/* 2-wire Serial Interface */
#define TWI_vect            _VECTOR(26)
#define TWI_vect_num        26

/* Store Program Memory Read */
#define SPM_READY_vect            _VECTOR(27)
#define SPM_READY_vect_num        27

/* USART1 RX complete */
#define USART1_RX_vect            _VECTOR(28)
#define USART1_RX_vect_num        28

/* USART1 Data Register Empty */
#define USART1_UDRE_vect            _VECTOR(29)
#define USART1_UDRE_vect_num        29

/* USART1 TX complete */
#define USART1_TX_vect            _VECTOR(30)
#define USART1_TX_vect_num        30

/* Timer/Counter3 Capture Event */
#define TIMER3_CAPT_vect            _VECTOR(31)
#define TIMER3_CAPT_vect_num        31

/* Timer/Counter3 Compare Match A */
#define TIMER3_COMPA_vect            _VECTOR(32)
#define TIMER3_COMPA_vect_num        32

/* Timer/Counter3 Compare Match B */
#define TIMER3_COMPB_vect            _VECTOR(33)
#define TIMER3_COMPB_vect_num        33

/* Timer/Counter3 Overflow */
#define TIMER3_OVF_vect            _VECTOR(34)
#define TIMER3_OVF_vect_num        34

#define _VECTORS_SIZE 140


/* Constants */

#define SPM_PAGESIZE 256
#define FLASHSTART   0x0000
#define FLASHEND     0x1FFFF
#define RAMSTART     0x0100
#define RAMSIZE      16384
#define RAMEND       0x40FF
#define E2START     0
#define E2SIZE      4096
#define E2PAGESIZE  8
#define E2END       0x0FFF
#define XRAMEND      RAMEND


/* Fuses */

#define FUSE_MEMORY_SIZE 3

/* Low Fuse Byte */
#define FUSE_SUT_CKSEL0  (unsigned char)~_BV(0)
#define FUSE_SUT_CKSEL1  (unsigned char)~_BV(1)
#define FUSE_SUT_CKSEL2  (unsigned char)~_BV(2)
#define FUSE_SUT_CKSEL3  (unsigned char)~_BV(3)
#define FUSE_SUT_CKSEL4  (unsigned char)~_BV(4)
#define FUSE_SUT_CKSEL5  (unsigned char)~_BV(5)
#define FUSE_CKOUT       (unsigned char)~_BV(6)
#define FUSE_CKDIV8      (unsigned char)~_BV(7)
#define LFUSE_DEFAULT    (FUSE_SUT_CKSEL0 & FUSE_SUT_CKSEL2 & FUSE_SUT_CKSEL3 & FUSE_SUT_CKSEL4 & FUSE_CKDIV8)


/* High Fuse Byte */
#define FUSE_BOOTRST     (unsigned char)~_BV(0)
#define FUSE_BOOTSZ0     (unsigned char)~_BV(1)
#define FUSE_BOOTSZ1     (unsigned char)~_BV(2)
#define FUSE_EESAVE      (unsigned char)~_BV(3)
#define FUSE_WDTON       (unsigned char)~_BV(4)
#define FUSE_SPIEN       (unsigned char)~_BV(5)
#define FUSE_JTAGEN      (unsigned char)~_BV(6)
#define FUSE_OCDEN       (unsigned char)~_BV(7)
#define HFUSE_DEFAULT    (FUSE_BOOTSZ0 & FUSE_BOOTSZ1 & FUSE_SPIEN & FUSE_JTAGEN)


/* Extended Fuse Byte */
#define FUSE_BODLEVEL0   (unsigned char)~_BV(0)
#define FUSE_BODLEVEL1   (unsigned char)~_BV(1)
#define FUSE_BODLEVEL2   (unsigned char)~_BV(2)
#define EFUSE_DEFAULT    (0xFF)



/* Lock Bits */
#define __LOCK_BITS_EXIST
#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST


/* Signature */
#define SIGNATURE_0 0x1E
#define SIGNATURE_1 0x97
#define SIGNATURE_2 0x06


#endif /* #ifdef _AVR_ATMEGA1284_H_INCLUDED */

